tests/load/chat-test.yml
# tests/load/chat-test.yml
# Prueba de WebSocket para Laravel Reverb

config:
  target: "ws://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 30
    - duration: 120
      arrivalRate: 30
    - duration: 30
      arrivalRate: 5
      rampTo: 0
  plugins:
    websocket: {}

variables:
  conversation_id: 1
  client_id: 1
  asesor_id: 2

scenarios:
  - name: "Chat en tiempo real"
    engine: "websocket"
    flow:
      - think: 1
      - send: |
          {
            "event": "pusher:subscribe",
            "data": {
              "channel": "private-conversation.{{ conversation_id }}"
            }
          }
      - think: 1
      - loop:
          - send: |
              {
                "event": "client-message",
                "data": {
                  "content": "Mensaje de prueba #{{ $randomNumber(1, 9999) }}",
                  "conversation_id": {{ conversation_id }},
                  "user_id": {{ client_id }}
                }
              }
          - think: 2
        count: 5
      - send: |
          {
            "event": "client-typing",
            "data": {
              "is_typing": true,
              "conversation_id": {{ conversation_id }},
              "user_id": {{ client_id }}
            }
          }
      - think: 1
      - send: |
          {
            "event": "client-typing",
            "data": {
              "is_typing": false,
              "conversation_id": {{ conversation_id }},
              "user_id": {{ client_id }}
            }
          }
      - think: 1
      - send: |
          {
            "event": "pusher:unsubscribe",
            "data": {
              "channel": "private-conversation.{{ conversation_id }}"
            }
          }
      - think: 1